Revit 2024 API
CustomExporter.Export2DIncludingAnnotationObjects Property
 This flag sets the exporter of 2D views to either include or exclude output of annotation objects when the model is being processed by the export context.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public bool Export2DIncludingAnnotationObjects { get; set; }
Visual Basic
Public Property Export2DIncludingAnnotationObjects As Boolean
	Get
	Set
Visual C++
public:
property bool Export2DIncludingAnnotationObjects {
	bool get ();
	void set (bool value);
}
Remarks
 A convenient way of determining whether an element category is annotation is using [!:Autodesk::Revit::DB::Category::CategoryType].
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace